In [2]:
# Importing Libraries
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

# Loading Data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

#Data Cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [6]:
df.sample(3)

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
435300,Data Engineer,Azure Data Engineer,"London, UK",via Melga,Full-time,False,United Kingdom,2023-02-25 16:51:54,True,False,United Kingdom,None,NaN,NaN,Nigel Frank International,"['python', 'sql', 'azure', 'pyspark']","{'cloud': ['azure'], 'libraries': ['pyspark'],..."
582095,Business Analyst,Jigs&Tools Engineer,"Astana, Kazakhstan",via Работа В Астане - HeadHunter,Full-time,False,Kazakhstan,2023-02-13 10:01:21,False,False,Kazakhstan,None,NaN,NaN,Alstom,['assembly'],{'programming': ['assembly']}
759771,Data Engineer,GIS Analyst,"Tallahassee, FL",via Trabajo.org,Full-time,False,Georgia,2023-09-02 21:20:07,False,False,United States,None,NaN,NaN,Crescens,"['java', 'oracle']","{'cloud': ['oracle'], 'programming': ['java']}"

In [8]:
df.sample(3, random_state=42)

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
502901,Senior Data Engineer,Senior Data Engineer,"St Paul, MN",via BeBee,Full-time,False,"Florida, United States",2023-12-17 11:09:06,False,False,United States,None,NaN,NaN,ManpowerGroup,"['sql', 'azure', 'git']","{'cloud': ['azure'], 'other': ['git'], 'progra..."
406337,Senior Data Scientist,Senior Analytics Engineer,"London, UK",via LinkedIn,Full-time,False,United Kingdom,2023-10-06 16:09:56,False,False,United Kingdom,None,NaN,NaN,Harnham,"['sql', 'python', 'bigquery', 'snowflake', 'lo...","{'analyst_tools': ['looker'], 'cloud': ['bigqu..."
659951,Data Engineer,Data Engineer,"Newcastle upon Tyne, UK",via Indeed,Full-time,False,United Kingdom,2023-09-06 10:11:25,True,False,United Kingdom,None,NaN,NaN,Morgan King,None,None

In [11]:
df_original = df

In [18]:
 df_altered = df_original.copy()

In [26]:
median_salary = df_altered['salary_year_avg'].median()

df_altered['salary_year_avg'] = df_altered['salary_year_avg'].fillna(median_salary)

In [32]:
df_altered.loc[:5, 'salary_year_avg']

0    115000.0
1    115000.0
2    115000.0
3    115000.0
4    115000.0
5    115000.0
Name: salary_year_avg, dtype: float64

In [31]:
df_original.loc[:5, 'salary_year_avg']

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
Name: salary_year_avg, dtype: float64